'''Реализовать два небольших скрипта:
● итератор, генерирующий целые числа, начиная с указанного;
● итератор, повторяющий элементы некоторого списка, определённого заранее.
Подсказка: используйте функцию count() и cycle() модуля itertools. Обратите внимание, что
создаваемый цикл не должен быть бесконечным. Предусмотрите условие его завершения.
Например, в первом задании выводим целые числа, начиная с 3. При достижении числа 10 —
завершаем цикл. Вторым пунктом необходимо предусмотреть условие, при котором
повторение элементов списка прекратится.'''

from itertools import count, cycle

for i in count(3):
    print(i)
    if i > 9:
        break

i = 0
stop = None

for el in cycle(['A', 'V', 'E']):
    #print(el)
    if i % 9 == 0:
        stop = input('Для прекращения повторения нажмите q или Enter для продолжения ')
        if stop == 'q' or stop == 'Q':
            break

    print(el)
    i += 1



